{
  "date": "2026-02-04",
  "last_updated": "2026-02-04T23:06:39Z",
  "season": "2025-26",
  "teams": {
    "Boston Celtics": [
      {
        "player": "Sam Hauser",
        "athlete_id": 4065804,
        "position": "F",
        "status": "Out",
        "comment": "With Hauser out and Jaylen Brown (hamstring/knee) doubtful, the Celtics are expected to be shorthanded in the second leg of this back-to-back set. Hugo Gonzalez and Jordan Walsh will likely see a significant bump in minutes, while Josh Minott may enter the rotation. Hauser's next opportunity to play will come Friday against Miami.",
        "ppg": 9.163265,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:28Z"
      },
      {
        "player": "Jaylen Brown",
        "athlete_id": 3917376,
        "position": "G",
        "status": "Day-To-Day",
        "comment": "The Celtics are playing the second game of a back-to-back set, and Brown is dealing with ailments in both of his appendages, so he'll likely skip Wednesday's game. With Brown watching from the sidelines, there will be more minutes available for Jordan Walsh and Hugo Gonzalez, and guys like Payton Pritchard and Derrick White will be asked to step it up on offense.",
        "ppg": 29.47826,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:28Z"
      },
      {
        "player": "Chris Boucher",
        "athlete_id": 3948153,
        "position": "F",
        "status": "Out",
        "comment": "It's widely believed that Boucher could be moved at the trade deadline, so this could certainly be related to that. Boucher is not part of Boston's rotation anyways.",
        "ppg": 2.3333333,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:28Z"
      },
      {
        "player": "Nikola Vucevic",
        "athlete_id": 6478,
        "position": "C",
        "status": "Day-To-Day",
        "comment": "The Celtics have been linked to several centers around the NBA, and they finally found their guy. Vucevic and Simons are both on expiring contracts, making this an easy sell for both clubs. Vucevic will likely supplant Neemias Queta in the starting lineup in Boston, but he may see less usage with his new squad. Vucevic can be considered questionable to debut against the Rockets on Wednesday, as Tuesday's game against Dallas is out of the question.",
        "ppg": 16.875,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:28Z"
      },
      {
        "player": "Jayson Tatum",
        "athlete_id": 4065648,
        "position": "F",
        "status": "Out",
        "comment": "Charania adds that the Celtics are \"cautiously optimistic\" about Tatum returning later in the season. Tatum himself is on record saying he isn't ruling out a return, and by all accounts, his rehab is going swimmingly. \"Clearly Jayson Tatum has a goal in his mind that he wants to play,\" Charania said. \"Whether he can get there by the time we're in February, March or April, we'll see.\" How Boston performs this season is likely to factor into Tatum's decision as well, making this is an intriguing storyline to watch.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:29Z"
      }
    ],
    "Cleveland Cavaliers": [
      {
        "player": "James Harden",
        "athlete_id": 3992,
        "position": "G",
        "status": "Out",
        "comment": "Harden was acquired by the Cavaliers from the Clippers on Tuesday in exchange for Darius Garland (toe) and a second-round pick. The Cavaliers and Clippers face off Wednesday in Los Angeles, but Harden won't have to go through facing his former team just one day after being dealt. Assuming he's cleared to play Saturday, Harden would join Donovan Mitchell to form a starting backcourt that has accumulated 18 All-Star selections between the superstar guards.",
        "ppg": 25.40909,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:29Z"
      },
      {
        "player": "Evan Mobley",
        "athlete_id": 4432158,
        "position": "C",
        "status": "Out",
        "comment": "Mobley has been diagnosed with a strained left calf, and the star big man could be sidelined for as many as three weeks. With the All-Star break looming in the middle of February, it's possible that the Cavaliers will exercise caution with Mobley. In the meantime, Nae'Qwan Tomlin, Jaylon Tyson and Dean Wade will all be asked to step up in the frontcourt.",
        "ppg": 17.904762,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:29Z"
      },
      {
        "player": "Max Strus",
        "athlete_id": 4065778,
        "position": "G",
        "status": "Out",
        "comment": "Strus hasn't yet made his season debut, and he needs even more time on the shelf to recover from offseason left foot surgery. It's unlikely the swingman will be ready to play until sometime in February at this point. In the meantime, Sam Merrill and Jaylon Tyson should continue helping fill out the minutes on the wing.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:30Z"
      }
    ],
    "Denver Nuggets": [
      {
        "player": "Christian Braun",
        "athlete_id": 4431767,
        "position": "G",
        "status": "Day-To-Day",
        "comment": "Braun logged 26 in his return from a lengthy layoff in Tuesday's loss to the Pistons, and it looks like he'll be available for the second leg of this back-to-back set. Braun is averaging 9.3 points, 3.9 rebounds and 2.5 assists per game this season.",
        "ppg": 9.266666,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:30Z"
      },
      {
        "player": "Cameron Johnson",
        "athlete_id": 3138196,
        "position": "F",
        "status": "Out",
        "comment": "Johnson hasn't played since Dec. 23 due to a right knee bone bruise and is without a clear timetable for a return. He should be considered doubtful for Saturday's game against the Bulls until Denver offers an update.",
        "ppg": 11.678572,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:30Z"
      },
      {
        "player": "Aaron Gordon",
        "athlete_id": 3064290,
        "position": "F",
        "status": "Out",
        "comment": "This is a brutal blow for Denver and for Gordon's fantasy managers. If he's re-evaluated at the front end of this timetable, a return against the Thunder on Feb. 27 would be the best-case scenario. In Gordon's absence, Peyton Watson will likely take on a larger role, and Spencer Jones and Bruce Brown could see more run as well.",
        "ppg": 17.652174,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:30Z"
      },
      {
        "player": "Tamar Bates",
        "athlete_id": 4683933,
        "position": "G",
        "status": "Out",
        "comment": "Bates underwent surgery Monday to repair a fractured left foot, and he's expected to miss about three months. Through 13 G League appearances, the two-way player has averaged 19.5 points, 4.2 rebounds, 2.2 assists and 1.6 steals in 33.2 minutes per game.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:31Z"
      }
    ],
    "Houston Rockets": [
      {
        "player": "Dorian Finney-Smith",
        "athlete_id": 2578185,
        "position": "F",
        "status": "Out",
        "comment": "The expectation is that the veteran forward will be ready to go for Thursday's tilt against the Hornets. Josh Okogie and Clint Capela should help fill out the frontcourt minutes Wednesday.",
        "ppg": 2.9411764,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:31Z"
      },
      {
        "player": "Kevin Durant",
        "athlete_id": 3202,
        "position": "F",
        "status": "Day-To-Day",
        "comment": "Durant was held out of Monday's matchup against the Pacers due to a left ankle sprain, but he appears on track to return in time for Wednesday's clash. Expect confirmation on his availability closer to game time.",
        "ppg": 26.177778,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:31Z"
      },
      {
        "player": "Steven Adams",
        "athlete_id": 2991235,
        "position": "C",
        "status": "Out",
        "comment": "Adams was already viewed as out indefinitely with a Grade 3 sprain, but now he won't be able to return during the 2025-26 campaign. The veteran big man is under contract with Houston through the 2027-28 season. With Adams' year now over, Clint Capela and Dorian Finney-Smith are set to split the backup center duties behind Alperen Sengun.",
        "ppg": 5.84375,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:31Z"
      },
      {
        "player": "Fred VanVleet",
        "athlete_id": 2991230,
        "position": "G",
        "status": "Out",
        "comment": "VanVleet struggled with efficiency during his second season in Houston, but the Rockets' win-loss record with him on the court (41-19) spoke volumes about his overall impact on the team. With VanVleet sidelined, the runway is clear for Reed Sheppard, who barely had a role as a rookie. Amen Thompson could also handle a ton of ball-handling responsibilities, while Aaron Holiday is the only other true point guard on the roster currently.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      }
    ],
    "LA Clippers": [
      {
        "player": "Ivica Zubac",
        "athlete_id": 4017837,
        "position": "C",
        "status": "Out",
        "comment": "This may raise some eyebrows with the trade deadline 24 hours away, but Azarly reports that this absence is not related to that. With Zubac out of the mix, the Clippers will likely lean more on Brook Lopez, John Collins and Derrick Jones.",
        "ppg": 14.395349,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      },
      {
        "player": "Darius Garland",
        "athlete_id": 4396907,
        "position": "G",
        "status": "Out",
        "comment": "After spending the first seven-plus years of his career in Cleveland, Garland is set to join the Clippers. The 26-year-old point guard hasn't played since Jan. 14 due to a right great toe sprain, so it's unclear when he'll be available to make his Clippers debut. Over 26 regular-season appearances with the Cavaliers this season, he averaged 18.0 points, 6.9 assists and 2.4 rebounds while shooting 45.1 percent from the field in 30.5 minutes per contest.",
        "ppg": 17.961538,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      },
      {
        "player": "TyTy Washington Jr.",
        "athlete_id": 4683749,
        "position": "G",
        "status": "Out",
        "comment": "Washington was a late addition to the injury report due to right hamstring soreness and won't be available Sunday. His next opportunity to suit up will come Tuesday against the Jazz.",
        "ppg": 7.0,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      },
      {
        "player": "Bradley Beal",
        "athlete_id": 6580,
        "position": "G",
        "status": "Out",
        "comment": "This is a devastating blow for Beal and the Clippers. The official diagnosis is a fractured left hip, and an exact timetable has yet to be announced. Beal signed a two-year, $11 million deal with the Clippers prior to the season, and the second year of his deal includes a player option which he may be likely to pick up with this news. With Beal out for the season, the Clippers could lean pretty heavily on Kris Dunn. Guys like Bogdan Bogdanovic and Chris Paul could reemerge too, but they've been afterthoughts in the rotation for the most part.",
        "ppg": 8.166667,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      }
    ],
    "Memphis Grizzlies": [
      {
        "player": "Taylor Hendricks",
        "athlete_id": 4684806,
        "position": "F",
        "status": "Out",
        "comment": "Hendricks was dealt from the Jazz to the Grizzlies on Tuesday, so he won't join his new team in time to suit up for Wednesday's game. However, there's a reasonable chance that he'll be ready for his team debut Friday in Portland.",
        "ppg": 4.939394,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      },
      {
        "player": "Walter Clayton Jr.",
        "athlete_id": 4896372,
        "position": "G",
        "status": "Out",
        "comment": "Clayton was involved in the trade that sent Jaren Jackson to the Jazz on Tuesday, and the former will have to wait to make his Grizzlies debut. Clayton's next opportunity to suit up for Memphis will come Friday against the Trail Blazers. The rookie first-rounder averaged 6.8 points, 3.2 assists and 2.0 rebounds across 18.0 minutes per game in 45 regular-season appearances with Utah. He could be in line for an increased workload in Memphis, especially if the club ends up trading Ja Morant (elbow).",
        "ppg": 6.8,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      },
      {
        "player": "Kyle Anderson",
        "athlete_id": 2993874,
        "position": "F",
        "status": "Out",
        "comment": "Anderson was traded by the Jazz on Tuesday to the Grizzlies for a return that centered around Jaren Jackson. Anderson spent four years of his NBA career in Memphis, and assuming he isn't shipped again ahead of Thursday's deadline, his next chance to play for the Grizzlies would be Friday against the Trail Blazers.",
        "ppg": 7.1,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:33Z"
      },
      {
        "player": "Scotty Pippen Jr.",
        "athlete_id": 4431785,
        "position": "G",
        "status": "Out",
        "comment": "This is the first time this season that Pippen has been upgraded to doubtful ahead of a game, so there's reason to believe he's nearing a return to action. While there's a good chance he'll be ruled out prior to Wednesday's matchup, his status will be worth keeping an eye moving forward.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:34Z"
      },
      {
        "player": "Santi Aldama",
        "athlete_id": 4593125,
        "position": "F",
        "status": "Out",
        "comment": "Aldama is in danger of missing a fifth straight game while dealing with a right knee injury. He'll presumably have an opportunity to prove his health in shootaround and warmups before the team provides another update on his status for Wednesday.",
        "ppg": 14.047619,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:34Z"
      },
      {
        "player": "Georges Niang",
        "athlete_id": 2990969,
        "position": "F",
        "status": "Out",
        "comment": "Niang continues to recover from offseason foot surgery, which prevented him from making his season debut with Utah. The forward remains without a clear timeline for a return, so it's difficult to envision how Niang's presence might affect the Memphis rotation until he finally takes the floor in 2025-26.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Ja Morant",
        "athlete_id": 4279888,
        "position": "G",
        "status": "Out",
        "comment": "Morant sustained a UCL sprain in his left elbow in the Jan. 21 game against the Hawks, and while he's expected to make a full recovery, he'll be re-evaluated in approximately three weeks. This means Morant won't return to action until probably after the All-Star break, impacting his potential trade value ahead of the Feb. 5 deadline. With Morant on the sidelines, the Grizzlies should turn to Cam Spencer and Vince Williams, although Ty Jerome (calf) should also see minutes at the point once he's fully healthy and ready to play.",
        "ppg": 19.45,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Zach Edey",
        "athlete_id": 4600663,
        "position": "C",
        "status": "Out",
        "comment": "After Edey initially sustained the injury Dec. 11, the Grizzlies relayed that the second-year center would be shut down for at least four weeks before being re-evaluated. Despite having spent the past month rehabbing the injury, Edey seemingly hasn't taken any major steps forward in his recovery and will now need another six weeks to let his ankle heal up. As a result of this latest update, Edey appears unlikely to be ready to return to game action until at least early March, making it tough to justify rostering him in most redraft formats. With Brandon Clarke (calf) also facing a long-term absence, Jock Landale should continue to hold down the fort as the Grizzlies' starting center.",
        "ppg": 13.636364,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Brandon Clarke",
        "athlete_id": 3906665,
        "position": "F",
        "status": "Out",
        "comment": "Based on this timetable, a return right after the All-Star break could potentially be on the table for Clarke. The forward has appeared in just two games this season, as he was dealing with a knee issue prior to his latest calf injury.",
        "ppg": 4.0,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      }
    ],
    "Milwaukee Bucks": [
      {
        "player": "Gary Harris",
        "athlete_id": 2999547,
        "position": "G",
        "status": "Out",
        "comment": "Harris will miss a fourth consecutive contest due to a left hamstring strain and is without a timetable for a return. The veteran swingman's next opportunity to play will come Friday against Indiana. In the meantime, Gary Trent and Cole Anthony (ankle) are candidates for increased playing time.",
        "ppg": 2.6857142,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Bobby Portis",
        "athlete_id": 3064482,
        "position": "F",
        "status": "Out",
        "comment": "Portis will be sidelined for his second straight game with his next chance to return coming Friday against the Pacers. Portis' name has surfaced in the rumor mill, but it's unclear if the Bucks are simply being cautious with this injury.",
        "ppg": 13.212766,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Cole Anthony",
        "athlete_id": 4432809,
        "position": "G",
        "status": "Day-To-Day",
        "comment": "Anthony twisted his left ankle during Tuesday's win over the Bulls, but it's not expected to keep him out of Wednesday's contest. Check back closer to tipoff for official confirmation on Anthony's status.",
        "ppg": 6.6857142,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Myles Turner",
        "athlete_id": 3133628,
        "position": "C",
        "status": "Day-To-Day",
        "comment": "Turner tweaked his ankle during Tuesday's win over the Bulls, but it appears he's planning on powering through. Managers can expect to get official confirmation on his status closer to Wednesday's tip.",
        "ppg": 12.891304,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Giannis Antetokounmpo",
        "athlete_id": 3032977,
        "position": "F",
        "status": "Out",
        "comment": "The writing has been on the wall for some time. Antetokounmpo has always said that he was willing to stick around in Milwaukee as long as the team was a title contender. But the Bucks are 18-27 on the season and sitting in 12th place in the Eastern Conference. To make things trickier for the franchise, Antetokounmpo is expected to miss several weeks with his latest calf injury.",
        "ppg": 27.966667,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Taurean Prince",
        "athlete_id": 2990962,
        "position": "F",
        "status": "Out",
        "comment": "Milwaukee labeled Prince as out indefinitely after he underwent surgery Nov. 13 to address a herniated disc in his neck. Approximately six weeks later, the Bucks haven't yet offered a more official timeline for Prince's return, but the team's decision to apply for a DPE implies that he's effectively being viewed as out for the season. Ultimately, an NBA-designated physician would need to concur with the Bucks' assessment that Prince is unlikely to return before June 15 in order for Milwaukee to be granted a DPE, which would enable to the team to sign a player to a one-year deal worth about $1.7 million -- half of Prince's salary -- or less. Before being shut down after undergoing surgery, Prince had appeared in the Bucks' first eight games of the season and averaged 6.1 points, 1.6 rebounds, 1.5 three-pointers, 1.0 assists and 0.8 steals in 21.0 minutes per contest.",
        "ppg": 6.125,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      }
    ],
    "Minnesota Timberwolves": [
      {
        "player": "Julius Randle",
        "athlete_id": 3064514,
        "position": "F",
        "status": "Day-To-Day",
        "comment": "Randle was also listed as questionable ahead of Monday's loss to Memphis, though he was ultimately cleared to play. If he's unable to suit up Wednesday, Naz Reid would likely enter the starting five, while Leonard Miller could enter the rotation.",
        "ppg": 22.235294,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Terrence Shannon Jr.",
        "athlete_id": 4432847,
        "position": "G",
        "status": "Out",
        "comment": "Shannon is still on the mend after suffer a left foot strain at the end of December. His next chance to suit up will arrive Friday against New Orleans.",
        "ppg": 4.5454545,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Anthony Edwards",
        "athlete_id": 4594268,
        "position": "G",
        "status": "Day-To-Day",
        "comment": "Edwards dropped 39 points in his last appearance Monday against the Grizzlies but evidently picked up a minor elbow injury along the way. The team should have a better idea of his availability closer to tipoff.",
        "ppg": 29.658537,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      }
    ],
    "New Orleans Pelicans": [
      {
        "player": "Hunter Dickinson",
        "athlete_id": 4432180,
        "position": "C",
        "status": "Day-To-Day",
        "comment": "Kevon Looney is expected to miss two to three weeks due to a proximal tibiofibular ligament, potentially opening some minutes up in the frontcourt. Derik Queen is still rehabbing from wrist surgery, so Dickinson has a chance to enter the rotation behind Yves Missi. He would likely need to outplay Karlo Matkovic for that to happen, however.",
        "ppg": 2.0,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:35Z"
      },
      {
        "player": "Dejounte Murray",
        "athlete_id": 3907497,
        "position": "G",
        "status": "Out",
        "comment": "For his part, Murray -- who underwent surgery Feb. 5, 2025 to address his torn right Achilles tendon -- hasn't provided an update since the Pelicans' media availability day back in September regarding where he stands in his rehab program. The 29-year-old hasn't necessarily hit any snags in his recovery, but Borrego noted that he couldn't \"say for sure\" that Murray will play any point in 2025-26 until the Pelicans get a chance to evaluate him live on the court during practices or scrimmages. At the very least, Borrego's comment about the Pelicans hoping to have more clarity on Murray's status in the next month would seem to indicate that New Orleans isn't counting on Murray making it back before the All-Star break in mid-February. In the meantime, rookie first-round pick Jeremiah Fears will continue to serve as the Pelicans' starting point guard amid Murray's absence.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      }
    ],
    "New York Knicks": [
      {
        "player": "Josh Hart",
        "athlete_id": 3062679,
        "position": "G",
        "status": "Out",
        "comment": "Hart was previously considered questionable due to a sprained left ankle, and he'll be unavailable for Thursday's game because of the issue. Hart sustained the injury during Tuesday's win over the Wizards. His next chance to play will come Friday at Detroit. In the meantime, look for Landry Shamet and Jordan Clarkson to absorb Hart's vacated minutes.",
        "ppg": 12.256411,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Miles McBride",
        "athlete_id": 4431823,
        "position": "G",
        "status": "Out",
        "comment": "McBride will be sidelined for a fifth straight game Wednesday, and he remains without a target date to return. He can be considered highly questionable for Friday's game versus Detroit.",
        "ppg": 12.885715,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Kevin McCullar Jr.",
        "athlete_id": 4411057,
        "position": "G",
        "status": "Out",
        "comment": "With the parent club nearly at full strength, McCullar made his first G League appearance since Dec. 22 and led the team in dimes. The 24-year-old has now played seven games with the Westchester Knicks this year, and it wouldn't be surprising to see him continue spending time in the G League as long as New York's backcourt is healthy.",
        "ppg": 2.3333333,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      }
    ],
    "Oklahoma City Thunder": [
      {
        "player": "Ajay Mitchell",
        "athlete_id": 4900671,
        "position": "G",
        "status": "Out",
        "comment": "Mitchell will miss his seventh straight outing due to an abdominal strain. While there isn't a concrete timetable for the 23-year-old guard's return to action, his next opportunity to play will come Saturday against Houston.",
        "ppg": 14.093023,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Chet Holmgren",
        "athlete_id": 4433255,
        "position": "C",
        "status": "Out",
        "comment": "The Thunder are sitting multiple players for the second leg of this back-to-back set, and that also includes Isaiah Hartenstein (eye). With that in mind, Jaylin Williams could be set up for a healthy workload Wednesday, and Branden Carlson could see more run as well.",
        "ppg": 17.688889,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Luguentz Dort",
        "athlete_id": 4397020,
        "position": "G",
        "status": "Out",
        "comment": "Dort is dealing with right knee inflammation and will be held out of the second leg of this back-to-back set. The Thunder will have only eight players available against the Spurs, so Aaron Wiggins, Cason Wallace and Isaiah Joe should see significant workloads. Dort's next opportunity to play will come Saturday against Houston.",
        "ppg": 8.853659,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Alex Caruso",
        "athlete_id": 2991350,
        "position": "G",
        "status": "Out",
        "comment": "Caruso will take a maintenance day on the second leg of a back-to-back set, but he should be back in action for Saturday's game against the Rockets. With Caruso, Shai Gilgeous-Alexander (abdominal), Luguentz Dort (patellofemoraljoint) and Ajay Mitchell (abdominal) all unavailable for Wednesday's game, the Thunder's backcourt will be quite thin. Expect big minutes for Aaron Wiggins, Cason Wallace and Isaiah Joe on Wednesday evening.",
        "ppg": 6.060606,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Isaiah Hartenstein",
        "athlete_id": 4222252,
        "position": "C",
        "status": "Out",
        "comment": "Hartenstein is dealing with a corneal abrasion and will miss the second leg of this back-to-back set. He's coming off a triple-double against the Magic on Tuesday with 12 points (4-6 FG, 0-1 3Pt, 4-5 FT), 10 rebounds, 10 assists and one block across 23 minutes. With Chet Holmgren (back) also out, the Thunder could rely heavily on Jaylin Williams and Branden Carlson.",
        "ppg": 10.962963,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Jared McCain",
        "athlete_id": 4683778,
        "position": "G",
        "status": "Out",
        "comment": "McCain will get a fresh start following an injury-riddled start to his young career. The 21-year-old guard got off to a hot start to his rookie season before undergoing surgery to repair a torn meniscus in his left knee in December 2024. The Duke product later underwent thumb surgery in September 2025 and missed time to begin the 2025-26 campaign. Once healthy, he struggled to carve out a consistent role behind Tyrese Maxey and VJ Edgecombe. Now, McCain will provide backcourt depth for Oklahoma City, competing for minutes with the likes of Cason Wallace, Ajay Mitchell and Nikola Topic (groin) once he returns. However, Shai Gilgeous-Alexander (abdomen) is set to be re-evaluated after the All-Star break, so McCain could see increased playing time right away.",
        "ppg": 6.6216216,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Shai Gilgeous-Alexander",
        "athlete_id": 4278073,
        "position": "G",
        "status": "Out",
        "comment": "This means that Gilgeous-Alexander will miss at least the next five games for the Thunder, which could elevate the newly acquired Jared McCain to a prominent role as Oklahoma City goes into the break. McCain, Ajay Mitchell, Cason Wallace, Aaron Wiggins and Isaiah Joe will all help fill the void while Gilgeous-Alexander is sidelined and Chet Holmgren should see a sizeable uptick in usage.",
        "ppg": 31.795918,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Jalen Williams",
        "athlete_id": 4593803,
        "position": "G",
        "status": "Out",
        "comment": "The club has yet to provide an update for Williams' return. He can be considered week-to-week until the team has more information to share on a timetable for his return to play.",
        "ppg": 16.833334,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:36Z"
      },
      {
        "player": "Nikola Topic",
        "athlete_id": 5159925,
        "position": "G",
        "status": "Out",
        "comment": "According to Presti, his doctors are \"extremely positive\" about his long-term outlook, but this is obviously an unfortunate situation for the young guard. There is no timetable for Topic's return, but the Thunder will likely provide more clarity in the near future. Ajay Mitchell has been filling in as Oklahoma City's backup point guard to open the season.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:38Z"
      },
      {
        "player": "Thomas Sorber",
        "athlete_id": 5061603,
        "position": "C",
        "status": "Out",
        "comment": "Sorber was selected No. 15 overall in the 2025 NBA Draft out of Georgetown by the reigning NBA champions. The rookie center was already dealing with a foot injury that cut his season with the Hoyas short and kept him out of the Summer League. Now he'll likely have to wait until the 2026-27 campaign to make his debut on the professional level.",
        "ppg": null,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      }
    ],
    "Sacramento Kings": [
      {
        "player": "Domantas Sabonis",
        "athlete_id": 3155942,
        "position": "F",
        "status": "Day-To-Day",
        "comment": "Sabonis participated in Tuesday's practice but is still in jeopardy of missing his third consecutive contest due to lower-back soreness. If the big man isn't cleared to play, Maxime Raynaud would likely get the starting nod, while Dylan Cardwell could see an uptick in minutes.",
        "ppg": 15.388889,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      },
      {
        "player": "Keegan Murray",
        "athlete_id": 4594327,
        "position": "F",
        "status": "Out",
        "comment": "Murray has been cleared to resume on-court activities amidst his recovery from a left ankle sprain. However, the timetable for his return now appears likely to put him out of action until sometime after the mid-February All-Star break. Until De'Andre Hunter is ready to make his Kings debut, Malik Monk and Nique Clifford should both continue to occupy a sizable role in the rotation.",
        "ppg": 14.578947,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      }
    ],
    "San Antonio Spurs": [
      {
        "player": "David Jones Garcia",
        "athlete_id": 4713010,
        "position": "F",
        "status": "Out",
        "comment": "Jones Garcia only managed to make 11 appearances for the Spurs in his introductory season, finishing with averages of 2.9 points and 1.6 assists per game. The 24-year-old rookie was on a one-year, two-way deal with the Spurs, so he'll be a free agent this summer.",
        "ppg": 2.909091,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      },
      {
        "player": "Kelly Olynyk",
        "athlete_id": 2489663,
        "position": "F",
        "status": "Day-To-Day",
        "comment": "Wednesday's game is the front end of a back-to-back set, so the Spurs may be cautious here. Olynyk has been used sparingly this season with an average of 9.5 minutes across 28 appearances.",
        "ppg": 3.4642856,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      },
      {
        "player": "Dylan Harper",
        "athlete_id": 5037871,
        "position": "G",
        "status": "Day-To-Day",
        "comment": "Harper was a late addition to the injury report for the front end of this back-to-back set. Stephon Castle is also questionable with adductor tightness, so the Spurs may be shorthanded in the backcourt against the Thunder. If one or both of Harper and Castle are ruled out, Julian Champagnie and Keldon Johnson would be candidates for increased minutes, while Jordan McLaughlin could enter the rotation.",
        "ppg": 10.743589,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      },
      {
        "player": "Jeremy Sochan",
        "athlete_id": 4610139,
        "position": "F",
        "status": "Out",
        "comment": "Sochan will miss a fourth consecutive contest due to a left quadriceps strain. The fourth-year forward's absence shouldn't affect the San Antonio rotation, though his next opportunity to suit up will come Thursday against the Mavericks.",
        "ppg": 4.2222223,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      },
      {
        "player": "Lindy Waters III",
        "athlete_id": 4066317,
        "position": "F",
        "status": "Out",
        "comment": "Waters faces a short turnaround if he wants to be available for Thursday's tilt in Dallas. However, the forward has totaled a mere 14 minutes across his last four appearances, so Waters' absence doesn't appear to shake up the San Antonio frontcourt mix.",
        "ppg": 1.9285715,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      },
      {
        "player": "Stephon Castle",
        "athlete_id": 4845367,
        "position": "G",
        "status": "Day-To-Day",
        "comment": "Castle is in danger of missing a second game due to a left adductor injury. The Spurs should have a better idea of whether he'll go Wednesday closer to tipoff.",
        "ppg": 16.564102,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      }
    ],
    "Toronto Raptors": [
      {
        "player": "Jakob Poeltl",
        "athlete_id": 3134908,
        "position": "C",
        "status": "Out",
        "comment": "Poeltl was managing a lingering back injury for the opening portion of the 2025-26 regular season, but he aggravated the issue against the Nets on Dec. 21 and hasn't played since. Rookie first-rounder Collin Murray-Boyles (thumb) and Sandro Mamukelashvili will continue to operate in expanded roles for as long as Poeltl is sidelined.",
        "ppg": 9.714286,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      },
      {
        "player": "Chucky Hepburn",
        "athlete_id": 4590360,
        "position": "G",
        "status": "Out",
        "comment": "Hepburn is nearly averaging a double-double across 11 appearances with 12.8 points, 9.2 assists and 1.9 rebounds. He's also been sound defensively with 2.4 steals per contest.",
        "ppg": 0.0,
        "ppg_rank": null,
        "updated_at": "2026-02-04T23:06:39Z"
      }
    ]
  }
}