{
  "date": "2026-02-10",
  "teams": {
    "Dallas Mavericks": [
      {
        "player": "Klay Thompson",
        "athlete_id": 6475,
        "team_id": "6",
        "position": "G",
        "status": "Day-To-Day",
        "comment": "Thompson isn't listed with an injury, but Dallas may opt to rest the veteran wing Tuesday. Over his past 10 games, the 36-year-old is averaging 12.8 points, 2.2 rebounds and 1.7 assists on 42.3 percent shooting from the field and 41.3 percent from beyond the arc in 21.5 minutes per contest. If Thompson sits, additional minutes could open up for recently acquired Khris Middleton, who's in line to make his team debut."
      },
      {
        "player": "Kyrie Irving",
        "athlete_id": 6442,
        "team_id": "6",
        "position": "G",
        "status": "Out",
        "comment": "Irving is still working his way through the rehab process for a torn ACL in his left knee, which he had surgically repaired March 26. While he said that Irving had \"no timeline\" for a return, Kidd didn't provide many details regarding where the veteran point guard stands in his recovery beyond relaying that he's \"in good spirits\" and \"feels great.\" Kidd also added that the 19-30 Mavericks' position in the standings won't dictate Irving's timeline for a return, instead noting that Irving will be back in action once he's physically and mentally ready. If Irving is able to make a late-season return, he'll likely be subject to heavy restrictions with his minutes, and his presence would presumably result in star rookie Cooper Flagg seeing more time off the ball."
      },
      {
        "player": "Dereck Lively II",
        "athlete_id": 4683688,
        "team_id": "6",
        "position": "C",
        "status": "Out",
        "comment": "Lively sought out multiple opinions on his right foot, but it was ultimately determined that season-ending surgery was the best course of action for the third-year center, and he's expected to make a full recovery ahead of the 2026-27 season. Daniel Gafford and Dwight Powell will continue to serve as the main big men for Dallas behind Anthony Davis in Lively's absence."
      }
    ],
    "Houston Rockets": [
      {
        "player": "Steven Adams",
        "athlete_id": 2991235,
        "team_id": "10",
        "position": "C",
        "status": "Out",
        "comment": "Adams was already viewed as out indefinitely with a Grade 3 sprain, but now he won't be able to return during the 2025-26 campaign. The veteran big man is under contract with Houston through the 2027-28 season. With Adams' year now over, Clint Capela and Dorian Finney-Smith are set to split the backup center duties behind Alperen Sengun."
      },
      {
        "player": "Fred VanVleet",
        "athlete_id": 2991230,
        "team_id": "10",
        "position": "G",
        "status": "Out",
        "comment": "VanVleet struggled with efficiency during his second season in Houston, but the Rockets' win-loss record with him on the court (41-19) spoke volumes about his overall impact on the team. With VanVleet sidelined, the runway is clear for Reed Sheppard, who barely had a role as a rookie. Amen Thompson could also handle a ton of ball-handling responsibilities, while Aaron Holiday is the only other true point guard on the roster currently."
      }
    ],
    "Indiana Pacers": [
      {
        "player": "Jarace Walker",
        "athlete_id": 5106060,
        "team_id": "11",
        "position": "F",
        "status": "Day-To-Day",
        "comment": "Walker is dealing with an illness and was an extremely late addition to the injury report. If he's unable to go Tuesday, Ben Sheppard, Kam Jones and Kobe Brown would be candidates for increased playing time. Walker has averaged 15.0 points, 7.0 rebounds and 2.4 assists in 27.8 minutes per contest over his last five games (two starts)."
      },
      {
        "player": "Ivica Zubac",
        "athlete_id": 4017837,
        "team_id": "11",
        "position": "C",
        "status": "Out",
        "comment": "After being acquired from the Clippers on Thursday, Zubac's debut continues to be put on hold due to a left ankle sprain. For now, it remains to be seen if Zubac will be able to return right after the All-Star break on Feb. 19 against the Wizards."
      },
      {
        "player": "Aaron Nesmith",
        "athlete_id": 4396909,
        "team_id": "11",
        "position": "G",
        "status": "Day-To-Day",
        "comment": "The Pacers have a back-to-back in New York first and then Brooklyn on Wednesday, prompting the team to consider giving Nesmith some load management. Ben Sheppard and Jarace Walker could have even more responsibilities on their plates if Nesmith doesn't go Tuesday."
      },
      {
        "player": "Micah Potter",
        "athlete_id": 4066399,
        "team_id": "11",
        "position": "C",
        "status": "Day-To-Day",
        "comment": "Potter managed to battle through the same issue during Sunday's game in Toronto, so he'll seemingly have a good chance to suit up barring any last-minute setbacks. The Pacers could have another update after watching him go through morning shootaround."
      },
      {
        "player": "T.J. McConnell",
        "athlete_id": 2530530,
        "team_id": "11",
        "position": "G",
        "status": "Day-To-Day",
        "comment": "McConnell didn't show any signs of a hamstring injury his last time on the court, but he's now in jeopardy of missing Tuesday's clash. The team should have a better idea of his status closer to tipoff."
      },
      {
        "player": "Johnny Furphy",
        "athlete_id": 5157066,
        "team_id": "11",
        "position": "G",
        "status": "Out",
        "comment": "Furphy started in 21 of 35 regular-season appearances for the Pacers, posting averages of 5.1 points, 4.4 rebounds, 1.2 assists and 0.7 three-pointers in 18.4 minutes per contest. While no timetable has been announced, Furphy's absence could extend through the beginning of the 2026-27 season. With this news, the Pacers will likely lean more on Ben Sheppard, Kam Jones and Quenton Jackson moving forward."
      },
      {
        "player": "Ethan Thompson",
        "athlete_id": 4278516,
        "team_id": "11",
        "position": "G",
        "status": "Day-To-Day",
        "comment": "Thompson barely touched the floor Monday, continuing the recent decline in playing time. It would appear as though Indiana will have very little to play for later in the season, other than lottery balls. Head coach Rick Carlisle has already shown his hand when it comes to experimenting with different lineups, something that could very well continue for the remainder of the season. Thompson can be dropped in most formats, although managers will want to keep an eye on things, just in case things change at some point."
      },
      {
        "player": "Obi Toppin",
        "athlete_id": 4278355,
        "team_id": "11",
        "position": "F",
        "status": "Out",
        "comment": "With the way the season has gone for Indiana, the team is in no position to rush Toppin back to the court. Fantasy managers should operate under the assumption that Toppin will be sidelined through the All-Star break."
      },
      {
        "player": "Tyrese Haliburton",
        "athlete_id": 4396993,
        "team_id": "11",
        "position": "G",
        "status": "Out",
        "comment": "Back in July, the Pacers ruled Haliburton out for the 2025-26 season shortly after the star point guard underwent surgery to address the Achilles tendon he tore in Indiana's loss to Oklahoma City in Game 7 of the NBA Finals. While the Pacers' stance with Haliburton doesn't appear to have changed amid a non-contending season, the 25-year-old is seemingly coming along even faster than anticipated during his rehab process. If Haliburton is able to advance to 5-on-5 work by the spring, he'll likely be in line for a relatively normal offseason and should be free of restrictions for the start of training camp next fall."
      }
    ],
    "LA Clippers": [
      {
        "player": "Darius Garland",
        "athlete_id": 4396907,
        "team_id": "12",
        "position": "G",
        "status": "Out",
        "comment": "Garland's sprained right toe is healed, but he's still recovering from offseason left toe surgery. It's sounds like the Clippers are erring on the side of caution ahead of the All-Star break, so it appears safe to rule out the star guard for Tuesday's game against the Rockets and Wednesday's rematch versus Houston, barring any changes to his status. Kris Dunn, Bennedict Mathurin and Jordan Miller should help pick up the slack in the backcourt."
      },
      {
        "player": "Bradley Beal",
        "athlete_id": 6580,
        "team_id": "12",
        "position": "G",
        "status": "Out",
        "comment": "This is a devastating blow for Beal and the Clippers. The official diagnosis is a fractured left hip, and an exact timetable has yet to be announced. Beal signed a two-year, $11 million deal with the Clippers prior to the season, and the second year of his deal includes a player option which he may be likely to pick up with this news. With Beal out for the season, the Clippers could lean pretty heavily on Kris Dunn. Guys like Bogdan Bogdanovic and Chris Paul could reemerge too, but they've been afterthoughts in the rotation for the most part."
      }
    ],
    "Los Angeles Lakers": [
      {
        "player": "Deandre Ayton",
        "athlete_id": 4278129,
        "team_id": "13",
        "position": "C",
        "status": "Day-To-Day",
        "comment": "Ayton started and played 29 minutes in the opening leg of the Lakers' back-to-back set Monday. He's at risk of missing the closing end of the two-game set due to a lingering knee injury. If he doesn't play Tuesday, Jaxson Hayes, Maxi Kleber and Drew Timme would see an increase in playing time."
      },
      {
        "player": "Austin Reaves",
        "athlete_id": 4066457,
        "team_id": "13",
        "position": "G",
        "status": "Out",
        "comment": "Reaves will miss the tail end of a back-to-back set for rest purposes. In addition to Reaves, Luka Doncic (hamstring), LeBron James (foot) and Marcus Smart (ankle) are out Tuesday, meaning Luke Kennard, Kobe Bufkin, Nick Smith and Dalton Knecht should see plenty of action. Reaves should be back in action Thursday against Dallas."
      },
      {
        "player": "Marcus Smart",
        "athlete_id": 2990992,
        "team_id": "13",
        "position": "G",
        "status": "Out",
        "comment": "This has the look of a maintenance day for the second leg of this back-to-back set -- Smart is one of a number of key players being held out. Luke Kennard, Nick Smith and Kobe Bufkin could see expanded roles with this news."
      },
      {
        "player": "LeBron James",
        "athlete_id": 1966,
        "team_id": "13",
        "position": "F",
        "status": "Out",
        "comment": "James is going to sit out for the second leg of this back-to-back set for injury maintenance. Austin Reaves (calf), Marcus Smart (ankle) and Luka Doncic (hamstring) are all sidelined, so the Lakers will be extremely shorthanded for this contest."
      },
      {
        "player": "Luka Doncic",
        "athlete_id": 3945274,
        "team_id": "13",
        "position": "G",
        "status": "Out",
        "comment": "This is an expected update from the Lakers. Doncic will miss his third straight game, and it remains to be seen if he'll be available to return Feb. 20 against the Clippers following the All-Star break. The Lakers are sitting a handful of key players Wednesday, so guys like Luke Kennard, Nick Smith and Kobe Bufkin could see expanded roles."
      }
    ],
    "New York Knicks": [
      {
        "player": "OG Anunoby",
        "athlete_id": 3934719,
        "team_id": "18",
        "position": "F",
        "status": "Day-To-Day",
        "comment": "Anunoby is in danger of missing his third straight game while managing right toe soreness. In the five contests prior to being sidelined, the wing averaged 22.8 points, 5.8 rebounds, 3.4 assists and 2.0 steals while shooting 55.8 percent from the field and 45.9 percent from beyond the arc. If Anunoby remains out Tuesday, rookie Mohamed Diawara is likely to see an uptick in playing time."
      },
      {
        "player": "Mitchell Robinson",
        "athlete_id": 4351852,
        "team_id": "18",
        "position": "C",
        "status": "Out",
        "comment": "Robinson will take a seat for the first half of New York's back-to-back in an effort to keep him fresh for Wednesday. Ariel Hukporti could be in line for an uptick in minutes in Robinson's absence."
      },
      {
        "player": "Miles McBride",
        "athlete_id": 4431823,
        "team_id": "18",
        "position": "G",
        "status": "Out",
        "comment": "After missing New York's last five games due to what the team called left ankle injury management, it has been revealed that McBride is dealing with a sports hernia. The 25-year-old guard is without a clear timetable for a return, but he shouldn't be expected to return until early April at the very earliest. With McBride sidelined, Tyler Kolek, Jose Alvarado (recently traded) and Jordan Clarkson are candidates for increased playing time."
      }
    ],
    "Phoenix Suns": [
      {
        "player": "Cole Anthony",
        "athlete_id": 4432809,
        "team_id": "21",
        "position": "G",
        "status": "Out",
        "comment": "Anthony has yet to join the Suns after being dealt from Milwaukee on Thursday, and he'll need to wait at least one more day before making his Phoenix debut. His next chance to take the court will arrive Wednesday against the Thunder."
      },
      {
        "player": "Isaiah Livers",
        "athlete_id": 4277957,
        "team_id": "21",
        "position": "F",
        "status": "Out",
        "comment": "Livers will miss the Suns' final two games before the All-Star break, and depending on how he's feeling afterward, he could miss even more time. The 27-year-old forward suffered a sprained left shoulder Thursday against Golden State. Livers has appeared in 29 games this season, averaging 2.2 points and 1.9 rebounds across 10.1 minutes."
      },
      {
        "player": "Grayson Allen",
        "athlete_id": 3135045,
        "team_id": "21",
        "position": "G",
        "status": "Out",
        "comment": "Allen had been playing well of late and was coming off a 21-point, five-rebound, four-assist performance in a loss to the Warriors on Thursday. He has scored at least 20 points in four of his previous five contests, but now he'll be sidelined until after the All-Star break at the earliest. Jordan Goodwin and Royce O'Neale should be in line for more minutes while Allen is sidelined."
      }
    ],
    "San Antonio Spurs": [
      {
        "player": "Lindy Waters III",
        "athlete_id": 4066317,
        "team_id": "24",
        "position": "F",
        "status": "Out",
        "comment": "Waters is in line for his fourth consecutive absence while tending to a left knee issue. His next opportunity to suit up will arrive Wednesday against Golden State."
      },
      {
        "player": "David Jones Garcia",
        "athlete_id": 4713010,
        "team_id": "24",
        "position": "F",
        "status": "Out",
        "comment": "Jones Garcia only managed to make 11 appearances for the Spurs in his introductory season, finishing with averages of 2.9 points and 1.6 assists per game. The 24-year-old rookie was on a one-year, two-way deal with the Spurs, so he'll be a free agent this summer."
      }
    ]
  }
}